unit keycard;

INTERFACE
uses crt;

procedure card_in;
procedure card_out;
procedure atm_mach;
procedure reset_side;

implementation

procedure card_out;

Const Dly = 200;

 var
 x:integer;
    begin
    Window (67, 7,76,12);
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
 (*-----------------------------------------*)
    Window (67, 7,76,12);
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);

    Window (67, 7,76,12);
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
  (*------------------------------------------------------------*)
    Window (67, 7,76,12);
    Write ('³ Û KEY  ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
   Window (67,7,76,12);
    Write ('ÚÄÜÄÄÄÄÄÄ¿');
    Write ('³ Û KEY  ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Window (67,12,77,12);
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Delay (dly*3);
  (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('ÍÍÍÍÍÍÍÍÍÍ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly*3);
  End;

procedure atm_mach;
 begin
    clrscr;
    Window (63,2,80,17);
    textcolor (yellow);
    clrscr;
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²ÖÄÄÄÄÄÄÄÄÄÄÄÄÄÄ·²');
    Write ('²ÓÄÄÄÄÄÄÄÄÄÄÄÄÄÄ½²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²ÕÍÍÍÍÍÍÍÍÍÍ¸²²²');
    Write ('²²²ÔÍÍÍÍÍÍÍÍÍÍ¾²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²ÖÄÄÄÄÄÄÄÄÄÄÄÄÄÄ·²');
    Write ('²ÓÄÄÄÄÄÄÄÄÄÄÄÄÄÄ½²');
    Write ('²²²²²²²²²²²²²²²²²²');
  end;

procedure card_in;

const
dly = 200;

  Begin
    Window (67,7,76,12);
    Write ('ÚÄÜÄÄÄÄÄÄ¿');
    Write ('³ Û KEY  ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Window (67,12,77,12);
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Delay (dly*3);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('³ Û KEY  ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('³ Û      ³');
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('³ Û      ³');
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('ÀÄßÄÄÄÄÄÄÙ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
    Delay (dly);
    (* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - *)
    Window (67, 7,76,12);
    Write ('ÍÍÍÍÍÍÍÍÍÍ');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Write ('²²²²²²²²²²');
    Window (67,12,77,12);
    Write ('²²²²²²²²²²');
  End;

  Procedure Reset_side;
  Begin
    Window (63,2,80,17);
    Clrscr;
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²ÖÄÄÄÄÄÄÄÄÄÄÄÄÄÄ·²');
    Write ('²ÓÄÄÄÄÄÄÄÄÄÄÄÄÄÄ½²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²ÕÍÍÍÍÍÍÍÍÍÍ¸²²²');
    Write ('²²²ÔÍÍÍÍÍÍÍÍÍÍ¾²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²²²²²²²²²²²²²²²²²²');
    Write ('²ÖÄÄÄÄÄÄÄÄÄÄÄÄÄÄ·²');
    Write ('²ÓÄÄÄÄÄÄÄÄÄÄÄÄÄÄ½²');
    Write ('²²²²²²²²²²²²²²²²²²');
  End;

  end.
